# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "node"
brew "sheldon"
brew "coreutils"
brew "nvm"
brew "tree"
brew "lsd"
brew "wget"
brew "yarn"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
brew "wifi-password"
brew "speedtest"
brew "bat"
brew "youtube-dl"
brew "watchman" # Watching files for Jest
brew "ffmpeg"
brew "imagemagick"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"

# Utils
cask "gpg-suite"

# Media
cask "handbrake"
cask "vlc"

# Development
cask "fig"
cask "multipass"
cask "iterm2"
cask "visual-studio-code"

# Desktop applications
cask "signal"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "steam"
cask "spotify"
cask "notion"
cask "discord"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Bitwarden", id: 1352778147
mas "Unsplash Wallpapers", id: 12848638472
mas "The Unarchiver",  id: 425424353
mas "Pandan", id: 1569600264
